---
type: BeamSystem
namespace: Autodesk.Revit.DB
version: 2024
members: 12
tags: [revit-api, class]
---

# BeamSystem

`Autodesk.Revit.DB.BeamSystem` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | BeamBelongsTo | — | `public static BeamSystem BeamBelongsTo ( FamilyInstance beam )` |
| Method | Create | — | `` |
| Method | DropBeamSystem | 2011 | `public static void DropBeamSystem ( BeamSystem beamSystem )` |
| Method | GetBeamIds | — | `public ICollection < ElementId > GetBeamIds ()` |
| Property | BeamSystemType | — | `public BeamSystemType BeamSystemType { get ; set ; }` |
| Property | BeamType | — | `public FamilySymbol BeamType { get ; set ; }` |
| Property | Direction | — | `public XYZ Direction { get ; }` |
| Property | Elevation | — | `public double Elevation { get ; set ; }` |
| Property | LayoutRule | — | `public LayoutRule LayoutRule { get ; set ; }` |
| Property | Level | — | `public Level Level { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Profile | — | `public CurveArray Profile { get ; set ; }` |